12/data/attachments/f84fa10c5c5d9256.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Melvin_continue_Friend_66307_3</nif:username>
            <nif:friendToBeRequested>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>